public class exercise {
   /*


    1) Инкапсуляцию (расставить private, где надо), сделать сеттеры и геттеры, где надо
    закрыть доступ к методам (если такие есть), которые не должны быть видны внешним потребителям

2) Добавить два поля - минимальную зарплату и максимальную зарплату

3) Добавить метод внутрь человека, который использует написанную вами утилиту для того,
    чтобы найти среднюю зарплату человека

    1. Сделать класс "Человек" абстрактным
1.1 Сделать метод расчета средней зарплаты абстрактным

2. Создать класс "Пенсионер", унаследоваться от класса Person
2.1 После наследования, необходимо будет реализовать метод расчета средней зарплаты. Реализуйте его так:
 Для расчета используйте созданную вами утилиту. Средняя зарплата расчитывается, как среднее значение из 3 показателей:
 1 - минимальная зарплата, 2 - максимальная зарплата, 3 - константное значение для всех пенсионеров = 2000

3. Создать класс Работник (Worker), унаследоваться от класса Person
2.1 После наследования, необходимо будет реализовать метод расчета средней зарплаты. Реализуйте его так:
 Для расчета используйте созданную вами утилиту. Средняя зарплата расчитывается как среднее значение из 2 показателей:
 1 - минимальная зарплата, 2 - максимальная зарплата


//Сделать класс Пенсионный фонд (аналог класса Больница из классной работы)
//В пенсионном фонде сделайте 1 метод - расчет будущей (или текущей пенсии)
//Метод принимает объекта класса Person
//Далее пенсия считается как 70% от средней зарплаты человека
//Метод возвращает double значение

//Попробуйте создать пенсионный фонд и рассчитайте зарплату 2-3 людей (пенсионеров и рабочих)

//*Можете добавить какие-то поля в пенсионный фонд (название фонда, год основания, количество вкладчиков) - не забываем про
//инкапсуляцию


1. Самостоятельно определить, в какие классы нужно добавить методы equals, hascode, toString
2. Реализовать (переопределить) методы equals, hascode, toString для этих классов
3. Equals, hascode разрещено сгенерировать через кнопку generate,
3.1 Метод toString нужно создать самостоятельно
4. Вариант реализации метода toString придумайте самостоятельно (самое главное - информативность)

    */
}
